Pundit/app/controllers/books_controller.rb

  def create
    @book = current_user.books.build(book_params)
    authorize @book
    if @book.save
---
INSERT INTO "books" ("title", "author_name", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    authorize @book
    if @book.update(book_params)
---
UPDATE "books" SET "author_name" = ?, "description" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["author_name", "Danish"], ["description", "hello"], ["updated_at", "2024-08-28 09:51:28.895986"], ["id", 4]]

  def destroy
    authorize @book
    @book.destroy
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]