Pundit/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("reviewer", "msg", "book_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["reviewer", "Pride and Prejudice"], ["msg", "new one"], ["book_id", 2], ["created_at", "2024-08-28 09:43:33.963899"], ["updated_at", "2024-08-28 09:43:33.963899"], ["user_id", 2]]
---
  def create
    @review = @book.reviews.build(review_params)
    @review.user = current_user
    authorize @review
    if @review.save

UPDATE "reviews" SET "reviewer" = ?, "msg" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["reviewer", "Danish"], ["msg", "qwerty"], ["updated_at", "2024-08-28 09:48:03.726870"], ["id", 4]]
---
  def update
    authorize @review
    if @review.update(review_params)

DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]
---
  def destroy
    authorize @review
    @review.destroy

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ? AND "reviews"."id" = ? LIMIT ?  [["book_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def set_review
    @review = @book.reviews.find(params[:id])